import * as Styled from "../../css/region.map.styled";
import { motion } from "framer-motion";
import * as main from "../../css/main.styled";
import TopAppBar from "../TopAppBar";
import DateandAreaInfo from "../DateAreaInfo";

export default function BomunKwon() {
    return(
        <main.MainContainer>
            <TopAppBar region="보문권" />
            <motion.div
            initial={{ opacity: 0, scale: 0.5 }}
            animate={{ opacity: 1, scale: 1 }}
            transition={{
            duration: 0.8,
            delay: 0.5,
            ease: [0, 0.71, 0.2, 1.01]
            }}
            >
                <DateandAreaInfo region="보문권" />
                <Styled.RegionSVG
                    id="보문권"
                    data-name="보문권"
                    width={390}
                    height={844}
                    viewBox="0 300 390 544"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                >
                    <g clipPath="url(#clip0_2071_249)">
                    <path
                        d="M68.4658 273L129.894 276.358L156.82 294.687L186.079 292.375L221.487 312.355L248.688 312.273L242.924 360.82L300.125 404.936L289.558 436.365L321.122 456.428L308.167 489.922L329 534.231L304.27 553H267.078L255.66 464.107L68.4658 273Z"
                        fill="#4E3529"
                    />
                    <path
                        d="M176.418 553H203.317L222.777 518.901L230.874 494.738L176.418 499.912V553Z"
                        fill="#4E3529"
                    />
                    <path
                        d="M113.755 275.477L144.139 296.613L122.812 299.861L68.4658 273L113.755 275.477Z"
                        fill="#B6836D"
                    />
                    <path
                        d="M178.394 292.98L212.347 312.273H242.018L235.87 361.15L292.275 404.799L283.739 437.521L317.225 456.098L302.403 489.289L319.476 531.919L297.545 553H267.078L193.216 328.07L156.82 294.687L178.394 292.98Z"
                        fill="#B6836D"
                    />
                    <path
                        d="M100.689 274.761L112.821 281.174L130.909 298.622V313.429L68.4658 273L100.689 274.761Z"
                        fill="#3C6827"
                    />
                    <path
                        d="M194.341 553L213.582 518.901H193.93L176.418 553H194.341Z"
                        fill="#B6836D"
                    />
                    <path
                        d="M169.995 293.641L204.03 312.273H191.871L156.82 294.687L169.995 293.641Z"
                        fill="#3C6827"
                    />
                    <path
                        d="M235.211 312.273L226.922 361.288L283.903 404.744L275.477 437.824L310.281 455.355L293.236 488.656L311.104 529.745L284.754 553H267.078L232.686 384.928L201.286 350.389L226.592 312.273H235.211Z"
                        fill="#3C6827"
                    />
                    <path
                        d="M183.911 553L201.286 518.901H193.93L176.418 553H183.911Z"
                        fill="#3C6827"
                    />
                    <path
                        opacity={0.2}
                        d="M267.078 553H304.269L329 534.231L303.144 529.222L267.078 553Z"
                        fill="#231F20"
                    />
                    <path
                        opacity={0.2}
                        d="M176.418 553H203.317L222.777 518.901H193.93L176.418 553Z"
                        fill="#231F20"
                    />
                    <path
                        opacity={0.2}
                        d="M304.269 454.612L321.122 456.428L308.167 489.922L285.632 487.913L304.269 454.612Z"
                        fill="#231F20"
                    />
                    <path
                        opacity={0.2}
                        d="M289.558 436.365L267.764 437.604L276.74 404.331L300.125 404.936L289.558 436.365Z"
                        fill="#231F20"
                    />
                    <path
                        opacity={0.2}
                        d="M248.688 312.273H226.592L218.221 365.223L242.924 360.82L248.688 312.273Z"
                        fill="#231F20"
                    />
                    <path
                        d="M193.93 518.901H222.777L267.078 553L303.144 529.249L285.633 487.913L304.27 454.612H302.897L270.701 442.75C268.615 441.98 267.38 439.806 267.764 437.604L276.63 407.799C277.069 405.377 275.642 403.01 273.308 402.267L223.518 367.04C221.13 366.269 219.648 363.902 219.977 361.425L226.565 312.245H191.844L156.82 294.687L122.812 299.861L103.242 283.32L68.4658 273L61 351.518L68.2188 423.843L112.519 448.64L164.204 539.57L176.39 553L193.902 518.901H193.93Z"
                        fill="#9ACD6F"
                    />
                    </g>
                    <defs>
                    <clipPath id="clip0_2071_249">
                        <rect
                        width={268}
                        height={280}
                        fill="white"
                        transform="translate(61 273)"
                        />
                    </clipPath>
                    </defs>
                </Styled.RegionSVG>
            </motion.div>
            <main.ExplainContainer>구경하고 싶은 지역을 클릭해 주세요</main.ExplainContainer>
        </main.MainContainer>      
    );    
}
